Repository: j6t/kdbg
Catalog: po/*.po
Languages: de

source: &Disable
de: &Deaktivieren

source: &Enable
de: &Aktivieren

source: active
de: aktiv

source: Locals
de: Lokale Variablen

source: Watched Expressions
de: &Beobachtete Ausdrücke

source: Registers
de: Register

source: Breakpoints
de: Haltepunkte

source: Output
de: Ausgabe

source: Memory
de: Speicher

source: &Open Source Code...
de: Quellcode ö&ffnen...

source: &Reload Source Code
de: Quellcode e&rneut laden

source: &Load Executable...
de: &Programm laden...

source: Recent E&xecutables
de: &Zuletzt geöffnete Programme

source: This &Program...
de: Dieses &Programm

source: &Global Options...
de: &Globale Einstellungen...

source: &Run
de: Aus&führen

source: Step &into
de: &In Funktion

source: Step &over
de: Ü&ber Funktion

source: Step o&ut
de: &Aus Funktion

source: Run to &cursor
de: &Zum Cursor

source: Step i&nto by instruction
de: I&nstruktion - in Funktion

source: Step o&ver by instruction
de: In&struktion - über Funktion

source: &Program counter to current line
de: &Programmzähler auf aktuelle Zeile

source: &Break
de: &Unterbrechen

source: &Kill
de: Been&den

source: Re&start
de: &Erneut ausführen

source: A&ttach...
de: A&ttachen...

source: &Detach
de: &Detachen

source: &Arguments...
de: Argu&mente...

source: Set/Clear &breakpoint
de: &Setzen/entfernen

source: Set &temporary breakpoint
de: &Temporären Haltepunkt setzen

source: &Enable/Disable breakpoint
de: &Aktiv/inaktiv

source: Watch Expression
de: Ausdruck beobachten

source: Edit Value
de: Wert bearbeiten

source: Restart
de: Erneut ausführen

source: Idle
de: Angehalten

source: Break
de: Unterbrechen

source: Busy/Running - Click to Break
de: Aktiv/Läuft gerade - Zum Unterbrechen klicken

source: `%1' is not a file or does not exist
de: `%1' ist keine Datei oder existiert nicht

source: Don't know how to debug language `%1'
de: Sprache `%1' unbekannt

source: XSL debugging is no longer supported and will be removed in a future version of KDbg
de: Der XSL-Modus wird nicht mehr unterstützt und wird in einer zukünftigen Version von KDbg entfernt werden.

source: Could not start the debugger process. Please shut down KDbg and resolve the problem.
de: Konnte den Debugger nicht starten. Bitte beenden Sie KDbg und beheben Sie das Problem.

source: Global Options
de: Globale Einstellungen

source: Miscellaneous
de: Verschiedenes

source: : Program output
de: : Programmausgabe

source: All source files
de: Alle Quellcodedateien

source: Source files
de: Quellcodedateien

source: Header files
de: Header-Dateien

source: All files
de: Alle Dateien

source: Open Source Code
de: Quellcode öffnen

source: Select the Executable to Debug
de: Programm zum Debuggen wählen

source: Select Core Dump
de: Core-Dump wählen

source: %1 exited unexpectedly. Restart the session (e.g. with File|Load Executable).
de: %1 wurde unerwartet beendet. Sie müssen die Sitzung neu starten (z.B. mit Datei|Programm laden).

source: The settings for this program specify the following debugger command: %1 Shall this command be used?
de: Die Einstellungen für dieses Programm legen folgende Debugger-Anweisung fest: %1 Soll diese Anweisung benutzt werden?

source: Setting the disassembly flavor failed.
de: Die Disassembler-Syntax konnte nicht geändert werden.

source: Value
de: Wert

source: <anonymous struct or union>
de: <anonyme struct oder union>

source: <additional entries of the array suppressed>
de: <weitere Einträge unterdrückt>

source: New working directory:
de: Neues Arbeitsverzeichnis:

source: A Debugger
de: Ein Debugger

source: XSLT debugging
de: XSLT debuggen

source: Register groups and formatting
de: Registergruppen und -formatierung

source: KDE4 porting
de: Portierung nach KDE4

source: transcript of conversation with the debugger
de: Mitschrift der Kommunikation zw. KDbg und gdb

source: remote debugging via <device>
de: entferntes Debuggen über <device>

source: specify language: C, XSLT
de: Programmiersprache: C, XSLT

source: use language XSLT (deprecated)
de: verwende XSLT (überholt, verwende -l stattdessen)

source: specify arguments of debugged executable
de: gibt Argumente für das Programm an

source: specify PID of process to debug
de: gibt den PID des zu debuggenden Prozesses an

source: path of executable to debug
de: Pfad zum zu debuggenden Programm

source: a core file to use
de: ein zu verwendender Core-Dump

source: Cannot start debugger.
de: Kann Debugger nicht ausführen.

source: Halfwords (&2 Bytes)
de: Halbwörter (&2 Bytes)

source: Words (&4 Bytes)
de: Wörter (&4 Bytes)

source: Giantwords (&8 Bytes)
de: Doppelwörter (&8 Bytes)

source: He&xadecimal
de: He&xadezimal

source: Signed &decimal
de: &Dezimal mit Vorzeichen

source: &Unsigned decimal
de: D&ezimal ohne Vorzeichen

source: &Octal
de: &Oktal

source: &Binary
de: &Binär

source: &Addresses
de: &Adressen

source: &Character
de: &Zeichen

source: &Floatingpoint
de: &Fließkomma

source: &Strings
de: &Zeichenketten

source: &Instructions
de: D&isassembliert

source: Select a file name to insert as program argument
de: Als Programmargument einzusetzende Datei wählen

# @action:button file name into text box
source: Insert
de: Einfügen

source: Select a directory to insert as program argument
de: Als Programmargument einzusetzendes Verzeichnis wählen

source: How to invoke &GDB - leave empty to use the default from the global options:
de: Aufruf von &GDB - wenn Sie dieses Feld leer lassen, wird die globale Einstellung übernommen:

source: Global Setting
de: Globale Einstellung

source: Disassembly flavor:
de: Disassembler-Syntax:

source: Disassembly flavor for x86 architecture
de: Disassembler-Syntax für die x86-Architektur

source: Disassembly flavor is only available for x86 architecture
de: Disassembler-Syntax kann nur für die x86-Architektur gewählt werden

source: &No input and output
de: &Keine Ein- und Ausgabe

source: &Only output, simple terminal emulation
de: Nur &Ausgabe, einfache Terminalemulation

source: &Full terminal emulation
de: &Volle Terminalemulation

source: Settings for %1
de: Einstellungen für %1

source: To revert to the default settings, clear the entries.
de: Wenn die Einträge leer sind, werden Standardeinstellungen verwendet.

source: How to invoke &GDB:
de: Aufruf von &GDB:

source: %T will be replaced with a title string, %C will be replaced by a Bourne shell script that keeps the terminal window open.
de: %T wird durch eine Überschrift ersetzt, %C wird durch eine Bourne-Shell-Skript ersetzt, das das Terminal-Fenster offen hält.

source: &Terminal for program output:
de: &Terminal für die Programmausgabe

source: Disassembly Flavor:
de: Disassembler-Syntax:

source: Default
de: Standard

source: &Pop into foreground when program stops
de: Debugger nach &vorne bringen, sobald das Programm stoppt

source: Time until window goes &back (in milliseconds):
de: Ver&zögerung, bis Debugger wieder nach hinten geht (in Millisek.):

source: &Tabstop every (characters):
de: &Tabulatorweite (in Zeichen):

source: File filter for &source files:
de: Dateifilter für &Quellcodedateien:

source: File filter for &header files:
de: Dateifilter für &Header-Dateien:

source: Specify the process number to attach to:
de: Geben Sie die Prozessnummer ein:

source: Cancel
de: Abbrechen

source: &GDB default
de: &GDB-Standard

source: &Decimal
de: &Dezimal

source: Real (&e)
de: Reell (&e)

source: Real (&f)
de: Reell (&f)

source: &Real (g)
de: &Reell (g)

source: Decoded value
de: Dekodierter Wert

source: GP and others
de: Allgemein u.a.

source: Flags
de: Schalter

source: Location
de: Ort

source: &Clear
de: &Löschen

source: Add
de: Neu

source: Del
de: Entf

source: Expression
de: Ausdruck

source: Search
de: Suche

source: &Case sensitive
de: &Groß-/Kleinschreibung

source: &Forward
de: &Vorwärts

source: &Backward
de: &Rückwärts

source: Close
de: Schließen

source: No memory dump available
de: Speicherinhalt nicht verfügbar

source: Address
de: Adresse

source: Hits
de: Stops

source: Ignore
de: Ignorieren

source: Condition
de: Bedingung

source: Add &Breakpoint
de: &Haltepunkt

source: Add &Watchpoint
de: &Watchpoint

source: &Remove
de: &Entfernen

source: &View Code
de: &Code anzeigen

source: &Conditional...
de: &Bedingt...

source: Conditional Breakpoint
de: Bedingten Haltepunkt setzen

source: Condi&tion:
de: &Bedingung:

source: Ignore &next hits:
de: Ignoriere &nächste Treffer:

source: do not ignore
de: nicht ignorieren

source: &File
de: &Datei

source: &View
de: &Ansicht

source: E&xecution
de: A&usführung

source: &Breakpoint
de: Halte&punkt

source: &Settings
de: &Einstellungen

source: Program Arguments
de: Programmargumente

source: &Arguments
de: &Argumente

source: Run <i>%1</i> with these arguments:
de: <i>%1</i> mit folgenden Argumenten ausführen:

source: Specify the arguments with which the program shall be invoked for this debugging session. You specify the arguments just as you would on the command line, that is, you can even use quotes and environment variables, for example:<p><tt>--message 'start in: ' $HOME</tt>
de: Geben Sie hier die Argumente an, mit denen das Programm in dieser Debug-Sitzung ausgeführt werden soll. Sie geben die Argumente genau so an, wie Sie das auch auf der Kommandozeile angeben würden; d.h. Sie können auch Anführungszeichen und Umgebungsvariablen verwenden, z.B.:<p><tt>--message 'start in: ' $HOME</tt>

source: Browse for a file; the full path name will be inserted at the current cursor location in the edit box above.
de: Suchen Sie nach einer Datei; der komplette Dateiname wird an der Cursorposition im obigen Feld eingefügt.

source: Insert &file name...
de: &Dateinamen einfügen...

source: Alt+F
de: Alt+D

source: Browse for a directory; the full path name will be inserted at the current cursor location in the edit box above.
de: Suchen Sie nach einem Verzeichnis;der komplette Verzeichnisname wird an der Cursorposition im obigen Feld eingefügt.

source: Insert &directory name...
de: &Verzeichnis einfügen...

source: Alt+D
de: Alt+V

source: &Working Directory
de: Arbeitsverzeichnis

source: Specify here the initial working directory where the program is run.
de: Geben Sie hier das Arbeitsverzeichnis an, in dem das Program ausgeführt werden soll.

source: Browse for the initial working directory where the program is run.
de: Hiermit suchen Sie das Arbeitsverzeichnis, in dem das Programm ausgeführt werden soll.

source: &Browse...
de: &Durchsuchen...

source: Alt+B
de: Alt+D

source: &Environment
de: &Umgebungsvariablen

source: Environment variables (<tt>NAME=value</tt>):
de: Umgebungsvariablen (<tt>NAME=Wert</tt>):

source: To add a new environment variable or to modify one, specify it here in the form <tt>NAME=value</tt> and click <b>Modify</b>.
de: Um eine neue Umgebungsvariable anzulegen oder eine vorhandene zu verändern, geben Sie sie hier in der Form <tt>NAME=Wert</tt> an und wählen Sie <b>Ändern</b>.

source: Environment variables that are set <i>in addition</i> to those that are inherited are listed in this table. To add new environment variables, specify them as <tt>NAME=value</tt> in the edit box above and click <b>Modify</b>. To modify a value, select it in this list and click <b>Modify</b>. To delete an environment variable, select it in this list and click <b>Delete</b>.
de: Die Umgebungsvariablen in dieser Liste werden <i>zusätzlich</i> zu den vererbten gesetzt. Um eine neue Umgebungsvariable anzulegen, geben Sie sie in der Form <tt>NAME=Wert</tt> im Eingebefeld an und wählen <b>Ändern</b>. Um den Wert zu verändern, wählen Sie die Variable in der Liste aus und wählen <b>Ändern</b>. Mit <b>Löschen</b> wird die ausgewählte Variable aus der Liste entfernt.

source: Enters the environment variable that is currently specified in the edit box into the list. If the named variable is already in the list, it receives a new value; otherwise, a new entry is created.
de: Fügt die Umgebungsvariable, die gerade im Eingabefeld angegeben ist, zu der Liste hinzu. Wenn die genannte Variable schon vorhanden ist, wird ihr Wert geändert.

source: &Modify
de: &Ändern

source: Alt+M
de: Alt+Ä

source: Deletes the selected environment variable from the list. This cannot be used to delete environment variables that are inherited.
de: Entfernt die ausgewählte Umgebungsvariable aus der Liste. Diese Funktion kann nicht verwendet werden, um vererbte Variablen zu entfernen.

source: &Delete
de: &Löschen

source: &xsldbg Options
de: &xsldbg-Einstellungen

source: Attach to Process
de: An Prozess attachen

source: Fi&lter or PID:
de: &Filter oder PID:

source: Type the name of the process or its process ID (PID) here to reduce the number of entries in the list.
de: Geben Sie hier den Programmnamen oder die Prozess-ID (PID) an, sodass weniger Einträge in der Tabelle aufscheinen.

source: <p>This list displays all processes that are currently running. You must select the process that you want KDbg to attach to. Use the <b>Filter or PID</b> edit box to reduce the number of entries in this list.<p>The text in the <i>Command</i> column is usually, but not always, the command that was used to start the process. The <i>PID</i> column shows the process ID. The <i>PPID</i> column shows the process ID of the parent process. Additional columns show more information about the processes that is also available via the system's <i>ps</i> command.</p><p>The list is not updated automatically. Use the <b>Refresh</b> button to update it.</p>
de: <p>Diese Tabelle zeigt alle Prozesse an, die gerade auf dem System laufen. Sie müssen einen Prozess auswählen, an den sich KDbg attachen soll. Geben Sie in <b>Filter oder PID</b> den Programmnamen oder die Prozess-ID ein; damit wird die Tabelle kürzer.<p>Der Text in der Spalte <i>Befehlszeile</i> ist normalerweise (aber nicht immer) der Befehl, mit dem der Prozess gestartet wurde. Die Spalte <i>PID</i> zeigt die Prozess-ID. Die Spalte <i>PPID</i> zeigt die Prozess-ID des Vater-Prozesses. In den weiteren Spalten stehen zusätzliche Informationen über die Prozesse, die auch mit dem Systembefehl <i>ps</i> angezeigt werden können.</p><p>Die Tabelle wird nicht automatisch aktualisiert. Benutzen Sie dazu die Schaltfläche <b>Aktualisieren</b>.</p>

source: Command
de: Befehlszeile

source: This button updates the list of processes.
de: Diese Schaltfläche aktualisiert die Anzeige.

source: &Refresh
de: &Aktualisieren
